#-------------------------------------------------------------------------------------------
#该部分为model 文件

def foo():
    pass


def bar():
    pass


# __name__是Python中一个隐含的变量它代表了模块的名字
# 只有被Python解释器直接执行的模块的名字才是__main__
if __name__ == '__main__':
    print('call foo()')
    foo()
    print('call bar()')
    bar()

#-------------------------------------------------------------------------------------------
#该部分为外部导入模块的操作
import module

# 导入module时 不会执行模块中if条件成立时的代码 因为模块的名字是module而不是__main__
#-------------------------------------------------------------------------------------------
